## Create Database for our project

In [44]:
## Library Imports
import os 
import pandas as pd
from pathlib import Path
import sqlite3

In [45]:
## Get directory and path
directory = 'data'
c = Path()
folder_path = c/directory

## create directory if doesnt exist
if not os.path.exists(folder_path):
    os.mkdir(folder_path)

In [46]:
## Create a Database
conn = sqlite3.connect('data/database.db')

In [47]:
def add_table(conn, data, table_name):
    """
    Funtion to add dataframe to sql databse

    Args:
    conn -> database connector
    data -> path of dataframe to insert into the db
    tabel_name -> name of the table in the database

    """

    ## Read the dataframe
    df = pd.read_csv(data)


    ## Insert into database
    df.to_sql(table_name, conn, index=False,if_exists='replace')

    print(f'{table_name} table has been created!')

In [48]:
## Add Primary dataset to DB (Patient Appointments)
add_table(conn, './data/raw_clinic_data.csv', "patient_appointments")

## Check data
df = pd.read_sql_query("SELECT * FROM patient_appointments", conn)
df.head()

patient_appointments table has been created!

,PatientId,AppointmentID,Gender,ScheduledDay,AppointmentDay,Age,Neighbourhood,Scholarship,Hipertension,Diabetes,Alcoholism,Handcap,SMS_received,No-show
0,2.987250e+13,5642903,F,2016-04-29T18:38:08Z,2016-04-29T00:00:00Z,62,JARDIM DA PENHA,0,1,0,0,0,0,No
1,5.589978e+14,5642503,M,2016-04-29T16:08:27Z,2016-04-29T00:00:00Z,56,JARDIM DA PENHA,0,0,0,0,0,0,No
2,4.262962e+12,5642549,F,2016-04-29T16:19:04Z,2016-04-29T00:00:00Z,62,MATA DA PRAIA,0,0,0,0,0,0,No
3,8.679512e+11,5642828,F,2016-04-29T17:29:31Z,2016-04-29T00:00:00Z,8,PONTAL DE CAMBURI,0,0,0,0,0,0,No
4,8.841186e+12,5642494,F,2016-04-29T16:07:23Z,2016-04-29T00:00:00Z,56,JARDIM DA PENHA,0,1,1,0,0,0,No

In [49]:
## Add 2nd dataset to DB (Weather)
add_table(conn, './data/weather.csv', "weather_data")

## Check data
df = pd.read_sql_query("SELECT * FROM weather_data", conn)
df.head()

weather_data table has been created!

,datetime,datetimeEpoch,tempmax,tempmin,temp,feelslikemax,feelslikemin,feelslike,dew,humidity,...,sunsetEpoch,moonphase,conditions,description,icon,stations,source,lat,log,Neighbourhood
0,2016-04-27,1461726000,92.8,75.3,82.4,97.0,75.3,84.7,69.4,66.4,...,1461788468,0.62,Clear,Clear conditions throughout the day.,clear-day,"['83649099999', 'SBVT']",obs,-20.319947,-40.342711,PARQUE MOSCOSO
1,2016-04-28,1461812400,80.6,73.4,77.0,83.3,73.4,77.3,67.4,72.4,...,1461874831,0.67,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"['83649099999', 'SBVT']",obs,-20.319947,-40.342711,PARQUE MOSCOSO
2,2016-04-29,1461898800,75.2,71.6,73.3,75.2,71.6,73.3,65.5,76.6,...,1461961193,0.72,"Rain, Partially cloudy",Partly cloudy throughout the day with afternoo...,rain,"['83649099999', 'SBVT']",obs,-20.319947,-40.342711,PARQUE MOSCOSO
3,2016-04-30,1461985200,80.6,69.8,75.4,83.9,69.8,75.8,68.5,79.3,...,1462047557,0.77,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"['83649099999', 'SBVT']",obs,-20.319947,-40.342711,PARQUE MOSCOSO
4,2016-05-01,1462071600,77.0,69.8,73.6,77.0,69.8,73.6,62.1,68.0,...,1462133922,0.83,Overcast,Cloudy skies throughout the day.,cloudy,"['83649099999', 'SBVT']",obs,-20.319947,-40.342711,PARQUE MOSCOSO

In [50]:
## Add 3rd dataset to DB (Hospital Ratings)
add_table(conn, './data/rating_processed.csv', "ratings_data")

## Check data
df = pd.read_sql_query("SELECT * FROM ratings_data", conn)
df.head()

ratings_data table has been created!

         lat        lon  rating
0 -37.319535 -59.166346    5.00
1 -27.615773 -48.627649    3.40
2 -27.451124 -58.986520    3.95
3 -24.114537 -49.335246    4.90
4 -23.707410 -47.425232    2.90

In [51]:
## Add locations mapping to DB
add_table(conn, './data/locations.csv', "location_data")

## Check data
df = pd.read_sql_query("SELECT * FROM location_data", conn)
df.head()

location_data table has been created!

           locations        lat        lon
0     PARQUE MOSCOSO -20.319947 -40.342711
1            MARUÍPE -20.296316 -40.319838
2     JARDIM CAMBURI -20.259980 -40.267894
3         BELA VISTA -22.107327 -56.531734
4  ILHA DAS CAIEIRAS -20.278013 -40.335515